### Agenda: 




* Handling duplicates in dataframe


* Use of duplicated method


* Use of drop_duplicates method

---

In [1]:
# Import Libraries

import pandas as pd

#### Create Dataframe

In [3]:
# Create Dataframe

df = pd.DataFrame({'id':[1,2,3,4,1,2,3,4,1,2,3,4], 
                   'customerName':['Tom','Harry', 'Meagan','Nancy','Tom','Harry', 'Meagan','Nancy','Tom','Harry', 'Meagan','Nancy'], 
                   'Age':[20,25,34,45,20,25,34,45,20,25,34,45]})

In [4]:
df

    id customerName  Age
0    1          Tom   20
1    2        Harry   25
2    3       Meagan   34
3    4        Nancy   45
4    1          Tom   20
5    2        Harry   25
6    3       Meagan   34
7    4        Nancy   45
8    1          Tom   20
9    2        Harry   25
10   3       Meagan   34
11   4        Nancy   45

#### Check Duplicates at the Series Level

In [5]:
# Returns true if the data is a duplciated value

df.customerName.duplicated()

0     False
1     False
2     False
3     False
4      True
5      True
6      True
7      True
8      True
9      True
10     True
11     True
Name: customerName, dtype: bool

In [6]:
df.customerName

0        Tom
1      Harry
2     Meagan
3      Nancy
4        Tom
5      Harry
6     Meagan
7      Nancy
8        Tom
9      Harry
10    Meagan
11     Nancy
Name: customerName, dtype: object

In [7]:
# Set ``keep`` parameter to ``last``

df.customerName.duplicated(keep='last')

0      True
1      True
2      True
3      True
4      True
5      True
6      True
7      True
8     False
9     False
10    False
11    False
Name: customerName, dtype: bool

In [9]:
# Count the number of duplciates

df.duplicated(keep='first').sum()

8

In [15]:
# Show rows that are duplicates
df.loc[df.duplicated(), :]

    id customerName  Age
4    1          Tom   20
5    2        Harry   25
6    3       Meagan   34
7    4        Nancy   45
8    1          Tom   20
9    2        Harry   25
10   3       Meagan   34
11   4        Nancy   45

In [16]:
# show all inclduing duplicates

df.loc[df.duplicated(keep=False), :]

    id customerName  Age
0    1          Tom   20
1    2        Harry   25
2    3       Meagan   34
3    4        Nancy   45
4    1          Tom   20
5    2        Harry   25
6    3       Meagan   34
7    4        Nancy   45
8    1          Tom   20
9    2        Harry   25
10   3       Meagan   34
11   4        Nancy   45

---

#### Drop Duplicates

In [17]:
# Drop all the duplicates except for the first items

df.drop_duplicates(keep='first')

   id customerName  Age
0   1          Tom   20
1   2        Harry   25
2   3       Meagan   34
3   4        Nancy   45

In [18]:
# Drop all the duplicates except for the last items

df.drop_duplicates(keep='last')

    id customerName  Age
8    1          Tom   20
9    2        Harry   25
10   3       Meagan   34
11   4        Nancy   45

In [19]:
# Drop all the data with duplicates

df.drop_duplicates(keep=False)

Empty DataFrame
Columns: [id, customerName, Age]
Index: []